#
#  Поработайте с переменными, создайте несколько, выведите на экран,
#  запросите у пользователя несколько чисел и строк и сохраните в переменные,
#  выведите на экран.
#


# целочисленная переменная
my_int_one = int(input("Введите первое целое число :"))
print("my_int_one = ", my_int_one)

my_int_two = int(input("Введите второе целое число: "))
print("my_int_two = ", my_int_two)

# строковая переменная
my_string = input("Введите первую строку: ")
print("my_string = ", my_string)
my_string = input("Введите вторую строку: ")
print("my_string = ", my_string)